export default {
    namespaced: true,
    state() {
        return {
            slides1: [{
                    id: 0,
                    service: 'سرویس اول',
                    title: 'تیتر 1',
                    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.'
                },
                {
                    id: 1,
                    service: 'سرویس دوم',
                    title: 'تیتر 2',
                    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.'
                },
                {
                    id: 2,
                    service: 'سرویس سوم',
                    title: 'تیتر 3',
                    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.'
                },
                {
                    id: 3,
                    service: 'سرویس چهارم',
                    title: 'تیتر 4',
                    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.'
                },

            ],
            slides2: [{
                desc: "توضیحات مختصر مربوط به عکس بالا",
                src: "img/slide1.png"
            }, {
                desc: "توضیحات مختصر مربوط به عکس بالا",
                src: "img/slide2.png"
            }, {
                desc: 'توضیحات مختصر مربوط به عکس بالا',
                src: "img/slide3.png"
            }, ],
            slides4: [{
                    src: 'img/sec4-1.png',
                    desc: 'توضیحات مختصر در رابطه با تصویر بالا'
                },
                {
                    src: 'img/sec4-2.png',
                    desc: 'توضیحات مختصر در رابطه با تصویر بالا'
                },
                {
                    src: 'img/sec4-3.png',
                    desc: 'توضیحات مختصر در رابطه با تصویر بالا'
                },
                {
                    src: 'img/sec4-4.png',
                    desc: 'توضیحات مختصر در رابطه با تصویر بالا'
                },
                {
                    src: 'img/sec4-5.png',
                    desc: 'توضیحات مختصر در رابطه با تصویر بالا'
                },
                {
                    src: 'img/sec4-6.png',
                    desc: 'توضیحات مختصر در رابطه با تصویر بالا'
                },

            ],
        }
    },
    getters: {
        slides1(state) {
            return state.slides1
        },
        slides2(state) {
            return state.slides2
        },
        slides4(state) {
            return state.slides4
        }
    }
};